package com.example.rentassistantapp.ui.profile

val document = """
    Общие положения  

    Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006 № 152-ФЗ «О персональных данных» (далее — Закон о персональных данных) и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые ИП Захарова Алина Андреевна (далее — Оператор).  

    1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.  

    1.2. Настоящая политика Оператора в отношении обработки персональных данных (далее — Политика) применяется ко всей информации, которую Оператор может получить о пользователях  данного мобильного приложения и Telegram-бота @RentAnAssistantBot
    
    Основные понятия, используемые в Политике
      
    2.1. Автоматизированная обработка персональных данных — обработка персональных данных с помощью средств вычислительной техники.

    2.2. Блокирование персональных данных — временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных).

    2.3. Telegram-бот — программное средство, доступное через мессенджер Telegram по адресу https://t.me/RentAnAssistantBot.

    2.4. Мобильное приложение RentAssistantApp — программное средство, доступное для загрузки и использования на мобильных устройствах, функционирующее в среде операционных систем Android.

    2.5. Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных и обеспечивающих их обработку информационных технологий и технических средств.

    2.6. Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных.

    2.7. Обработка персональных данных — любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными.

    2.8. Оператор — государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и/или осуществляющие обработку персональных данных.

    2.9. Персональные данные — любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю мобильного приложения RentAssistantApp и/или Telegram-бота @RentAnAssistantBot.

    2.10. Персональные данные, разрешенные субъектом для распространения — персональные данные, доступ к которым предоставлен субъектом персональных данных путем согласия.

    2.11. Пользователь — любой человек, взаимодействующий с мобильным приложением RentAssistantApp и/или Telegram-ботом @RentAnAssistantBot.

    2.12. Предоставление персональных данных — действия, направленные на раскрытие персональных данных определенному лицу или кругу лиц.

    2.13. Распространение персональных данных — действия, направленные на раскрытие данных неопределенному кругу лиц.

    2.14. Трансграничная передача — передача персональных данных на территорию иностранного государства.

    2.15. Уничтожение персональных данных — действия, в результате которых данные уничтожаются без возможности восстановления.
    

    Основные права и обязанности Оператора  

    3.1. Оператор имеет право:  

    — получать достоверные сведения от субъекта;  

    — продолжить обработку данных при отзыве согласия в случаях, предусмотренных законом;  

    — самостоятельно определять меры обеспечения исполнения обязанностей, предусмотренных законодательством.  

    3.2. Оператор обязан:  

    — предоставлять информацию субъекту по его запросу;  

    — организовывать обработку в соответствии с законодательством РФ;  

    — отвечать на обращения субъектов;  

    — направлять данные по запросу уполномоченного органа;  

    — публиковать настоящую Политику;  

    — принимать меры защиты персональных данных;  

    — прекращать обработку и уничтожать данные в установленных случаях;  

    — исполнять иные обязанности, предусмотренные законодательством.  

    Основные права и обязанности субъектов персональных данных  

    4.1. Субъекты имеют право:  

    — получать информацию об обработке своих данных;  

    — требовать уточнения, блокирования или уничтожения данных;  

    — устанавливать предварительное согласие на обработку в маркетинговых целях;  

    — отзывать согласие на обработку данных;  

    — обжаловать действия Оператора;  

    — иные права, установленные законодательством.  

    4.2. Субъекты обязаны:  

    — предоставлять достоверные сведения о себе;  

    — уведомлять об изменениях в данных.  

    4.3. Лица, предоставившие недостоверные сведения, несут ответственность согласно законодательству.  

    Принципы обработки персональных данных  

    5.1. Обработка осуществляется законно и добросовестно.  

    5.2. Цели обработки определяются заранее и должны быть законными.  

    5.3. Не допускается объединение несовместимых баз данных.  

    5.4. Обработка ограничивается достижением конкретных целей.  

    5.5. Избыточность обработки недопустима.  

    5.6. Обеспечивается точность и актуальность данных.  

    5.7. Хранение осуществляется до достижения целей либо установленного срока хранения.  

    Цели обработки персональных данных  

    Цель обработки — информирование Пользователя посредством отправки сообщений через Telegram-бот.  

    Персональные данные: ФИО, номер телефона, электронная почта.  

    Правовые основания: уставные документы Оператора.  

    Виды обработки: сбор, запись, систематизация, накопление, хранение, уничтожение, обезличивание, отправка уведомлений.  

    Условия обработки персональных данных  

    7.1. Обработка производится с согласия субъекта.  

    7.2. Возможна в рамках закона или договора.  

    7.3. Допустима для правосудия и исполнения судебных актов.  

    7.4. Допустима при защите прав Оператора.  

    7.5. Допустима при наличии общественного интереса.  

    7.6. Осуществляется обработка общедоступных данных.  

    7.7. Осуществляется обработка данных, обязательных к раскрытию по закону.  

    Порядок сбора, хранения, передачи и других видов обработки  

    8.1. Оператор обеспечивает сохранность и исключает доступ третьих лиц.  

    8.2. Передача третьим лицам возможна только по закону или с согласия.  

    8.3. Пользователь может направить запрос на актуализацию данных на email: podborkadrovru@mail.ru с темой «Актуализация персональных данных».  

    8.4. Срок обработки ограничен достижением цели. Пользователь может отозвать согласие, написав на email с темой «Отзыв согласия на обработку персональных данных».  

    8.5. Оператор не несёт ответственность за действия третьих лиц, в т.ч. платёжных систем и провайдеров.  

    8.6. Запреты субъекта не действуют в случае государственного или общественного интереса.  

    8.7. Оператор обеспечивает конфиденциальность.  

    8.8. Хранение данных осуществляется до достижения цели либо окончания срока.  

    8.9. Прекращение обработки осуществляется при наступлении условий, установленных законом.  

    Перечень действий с персональными данными  

    9.1. Оператор осуществляет: сбор, запись, систематизацию, накопление, хранение, уточнение, извлечение, использование, передачу, обезличивание, блокирование, удаление, уничтожение.  

    9.2. Обработка может быть автоматизированной или неавтоматизированной.  

    Трансграничная передача персональных данных  

    10.1. Оператор уведомляет уполномоченный орган до начала трансграничной передачи.  

    10.2. До подачи уведомления необходимо получить информацию от принимающей стороны.  

    Конфиденциальность персональных данных  

    Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать их третьим лицам без согласия субъекта, за исключением случаев, предусмотренных законом.  

    Заключительные положения  

    12.1. Пользователь может получить разъяснения, написав на email: podborkadrovru@mail.ru.  

    12.2. Изменения Политики вступают в силу с момента публикации новой версии.  

    12.3. Актуальная версия Политики доступна в последней доступной версии приложения RentAssistantApp, по запросу у Оператора или в интерфейсе Telegram-бота @RentAnAssistantBot. 


""".trimIndent()
